In [3]:
%matplotlib inline
import pandas as pd

In [4]:
##from IPython.core.display import HTML
#css = open('style-table.css').read() + open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [4]:
movies = pd.read_csv('/Users/mypc/Desktop/LetsUpgrade/titles.csv')
movies.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

### 1. How many movies are listed in the titles dataframe?

In [32]:
count = len(movies)
print("No. of movies in a dataframe: ", count)

No. of movies in a dataframe:  244914

### 2. What are the earliest two films listed in the titles dataframe?

In [30]:
movies.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### 3. How many movies have the title "Hamlet"?

In [12]:
len(movies[movies.title == 'Hamlet'])

20

### 4. How many movies are titled "North by Northwest"?

In [35]:
len(movies[movies.title == 'North by Northwest'])

1

### 5. When was the first movie titled "Hamlet" made?

In [37]:
movies[movies.title == 'Hamlet'].sort_values('year').head(1)

        title  year
52521  Hamlet  1910

### 6. List all of the "Treasure Island" movies from earliest to most recent.

In [38]:
movies[movies.title == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### 7. How many movies were made in the year 1950?

In [40]:
len(movies[movies.year == 1950])

1113

### 8. How many movies were made in the year 1960?

In [41]:
len(movies[movies.year == 1960])

1549

### 9. How many movies were made from 1950 through 1959?

In [13]:
len(movies[(movies.year >= 1950) & (movies.year <= 1959)])

12934

### 10. In what years has a movie titled "Batman" been released?

In [18]:
# Years when movie titled as "Batman" are shown

res = movies[movies.title == 'Batman']
res

         title  year
39349   Batman  1943
240896  Batman  1989

In [29]:
# Years when movies containing titled as "Batman" are shown

#res = movies[movies['title'].str.contains('^Batman.*') == True]
#res.sort_values('year')

### 11. How many roles were there in the movie "Inception"?

In [32]:
roles = pd.read_csv('/Users/mypc/Desktop/LetsUpgrade/cast.csv')
roles.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [44]:
df = roles[roles.title == 'Inception']
df['type'].value_counts()

actor      56
actress    22
Name: type, dtype: int64

### 12. How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [52]:
df1 = roles[roles.title == 'Inception']
len(df1) - df1['n'].count()

27

### 13. But how many roles in the movie "Inception" did receive an "n" value?

In [53]:
df1 = roles[roles.title == 'Inception']
df1['n'].count()

51

### 14. Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [58]:
df2 = roles[roles.title == 'North by Northwest'].sort_values('n')
df2[['title', 'type', 'n']].dropna()

                      title     type     n
871426   North by Northwest    actor   1.0
3518333  North by Northwest  actress   2.0
1457165  North by Northwest    actor   3.0
3157232  North by Northwest  actress   4.0
356707   North by Northwest    actor   5.0
3048272  North by Northwest  actress   6.0
1695173  North by Northwest    actor   7.0
1275337  North by Northwest    actor   8.0
2447081  North by Northwest    actor   9.0
1811387  North by Northwest    actor  10.0
665768   North by Northwest    actor  11.0
2295714  North by Northwest    actor  12.0
464736   North by Northwest    actor  13.0
1508344  North by Northwest    actor  14.0
206471   North by Northwest    actor  15.0
1384780  North by Northwest    actor  16.0

### 15. Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [60]:
df3 = roles[(roles.title == 'Sleuth') & (roles.year == 1972)].sort_values('n')
df3

,title,year,name,type,character,n
1705394,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
326773,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
373876,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1465483,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2724553,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1448690,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### 16. Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [61]:
df3 = roles[(roles.title == 'Sleuth') & (roles.year == 2007)].sort_values('n')
df3

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

### 17. How many roles were credited in the silent 1921 version of Hamlet?

In [65]:
df4 = roles[(roles.title == 'Hamlet') & (roles.year == 1921)]
df4['type'].value_counts()

actor      6
actress    3
Name: type, dtype: int64

### 18. How many roles were credited in Branagh’s 1996 Hamlet?

In [75]:
df4 = roles[(roles.title == 'Hamlet') & (roles.year == 1996)]
df4['type'].value_counts()

actor      43
actress    11
Name: type, dtype: int64

### 19. How many "Hamlet" roles have been listed in all film credits through history?

In [76]:
df5 = roles[(roles.title == 'Hamlet')]
df5['type'].value_counts()

actor      264
actress     78
Name: type, dtype: int64

### 20. How many people have played an "Ophelia"?

In [81]:
len(roles[(roles.character == 'Ophella')])

1

### 21. How many people have played a role called "The Dude"?

In [92]:
len(roles[(roles.character == 'The Dude')])

19

### 22. How many people have played a role called "The Stranger"?

In [93]:
a = len(roles[(roles.character == 'The stranger')])
b = len(roles[(roles.character == 'The Stranger')])
df6 = a + b
print(df6)

221

### 23. How many roles has Sidney Poitier played throughout his career?

In [95]:
len(roles[(roles.name == 'Sidney Poitier')])

43

### 24. How many roles has Judi Dench played?

In [96]:
len(roles[(roles.name == 'Judi Dench')])

55

### 25. List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [104]:
df6 = roles[(roles.name == 'Cary Grant') & (roles.n == 2.0) & (roles.year >= 1940)].sort_values('year')
df6

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### 26. List the leading roles that Cary Grant played in the 1940s in order by year.

In [105]:
df7 = roles[(roles.name == 'Cary Grant') & (roles.n == 1.0) & (roles.year >= 1940)].sort_values('year')
df7

,title,year,name,type,character,n
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0
871396,Crisis,1950,Cary Grant,actor,Dr. Eugene Norland Ferguson,1.0
871434,People Will Talk,1951,Cary Grant,actor,Dr. Noah Praetorius,1.0
871420,Monkey Business,1952,Cary Grant,actor,Dr. Barnaby Fulton,1.0
871435,Room for One More,1952,Cary Grant,actor,George Rose,1.0
871400,Dream Wife,1953,Cary Grant,actor,Clemson Reade,1.0
871458,To Catch a Thief,1955,Cary Grant,actor,John Robie,1.0
871451,The Pride and the Passion,1957,Cary Grant,actor,Anthony,1.0
871389,An Affair to Remember,1957,Cary Grant,actor,Nickie Ferrante,1.0
871416,Kiss Them for Me,1957,Cary Grant,actor,Cmdr. Andy Crewson,1.0
871414,Indiscreet,1958,Cary Grant,actor,Philip Adams,1.0
871410,Houseboat,1958,Cary Grant,actor,Tom Winters,1.0
871426,North by Northwest,1959,Cary Grant,actor,Roger O. Thornhill,1.0
871432,Operation Petticoat,1959,Cary Grant,actor,Lt. Cmdr. Matt T. Sherman,1.0
871447,The Grass Is Greener,1960,Cary Grant,actor,"Victor Rhyall, Earl",1.0
871441,That Touch of Mink,1962,Cary Grant,actor,Philip Shayne,1.0
871395,Charade,1963,Cary Grant,actor,Peter Joshua,1.0
871403,Father Goose,1964,Cary Grant,actor,Walter,1.0
871462,Walk Don't Run,1966,Cary Grant,actor,Sir William Rutland,1.0

### 27. How many roles were available for actors in the 1950s?

In [107]:
len(roles[(roles.type == 'actor') & (roles.year >= 1950) & (roles.year < 1960)])

157738

### 28. How many roles were available for actresses in the 1950s?

In [108]:
len(roles[(roles.type == 'actress') & (roles.year >= 1950) & (roles.year < 1960)])

57733

### 29. How many leading roles (n=1) were available from the beginning of film history through 1980?

In [112]:
df8 = roles[(roles.year <= 1980)]
df8['type'].value_counts()

actor      851444
actress    331363
Name: type, dtype: int64

### 30. How many non-leading roles were available through from the beginning of film history through 1980?

In [113]:
df8 = roles[(roles.year <= 1980) & (roles.n > 1.0)]
df8['type'].value_counts()

actor      462223
actress    207097
Name: type, dtype: int64

### 31. How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [118]:
df8 = roles[(roles.year >= 1980) & (roles.year < 1990)]
#df8['type'].value_counts()
df8['n'].isnull().sum()

53028